#include<stdio.h>

//函数
int Add(int x, int y)
{
    return x + y;
}
int main()
{
    //数组
    //10个整形1-10存起来
    int arr[10] = {1,2,3,4,5,6,7,8,9,10};
    char ch[5] = {'a','b','c'}; //不完全初始化，剩余的元素默认为0

    //数组是用下标访问的 
    //arr[0] = 1;
    int i = 0;
    for (i = 0; i < 10; i++)
    {
        printf("%d ",arr[i]);
    }
    // 1 2 3 4 5 6 7 8 9 10

    //函数
    int num1 = 0;
    int num2 = 0;
    scanf("%d %d",&num1,&num2);
    int sum = Add(num1,num2);
    printf("sum = %d\n",sum);

    //循环
    int line = 0;
    while (line < 10)
    {
        printf("写代码：%d\n",line);
        line++;
    }
    if (line == 10)
    {
        printf("写完了！\n");
    }
    
    //条件
    int input = 0;
    printf("加入：");
    printf("好好学习(1/0)?>:");
    scanf("%d",&input);
    if(input == 1)
    {
        printf("加油！\n");
    }
    else
    {
        printf("卖红薯！\n");
    }

    //算术操作符
    int a = 9/2;  //4
    float b = 9/2;  //4.0 若两个数都是整形，结果也是整形
    float c = 9.0/2;  //4.5
    printf("a = %d b = %f c = %f\n",a,b,c);
    int d = 9%2;  //1 取余(得余数)
    
    //移位操作符 << >>
    int e = 2;
    int f = e << 1; //左移操作符--移动二进制位
    // int 4个字节 32位 00000000 00000000 00000000 00000010
    // 左移一位 00000000 00000000 00000000 00000100 -- 4  f = 4
    printf("f = %d\n",f);

    //位操作符
    int g = 3;
    int h = 5;
    int z = g & h;  //按位与 00000011 00000101 -- 00000001 -- 1
    int j = g | h;  //按位或 00000011 00000101 -- 00000111 -- 7
    int k = g ^ h;  //按位异或 00000011 00000101 -- 00000110 -- 6
    

    //赋值操作符
    int m = 0;
    m = 10;  //赋值
    m += 10;  //m = m + 10;

    //单目操作符：只有一个操作数  （比如a+b +有两个操作数 双目操作符）
    //  !
    // 0 表示假 非0表示真
    int n = 0;
    printf("%d",!n); // 1

    if(n)
    {
        //如果a为真，做事
    }
    if(!n)
    {
        //如果a为假，做事
    }

    // + 正值 - 负值
    // sizeof是一个操作符 求变量后面的括号可以省略(求类型不行)，函数不可以，用来计算数据类型的大小
    int o = 0;
    printf("%d\n",sizeof(o)); //4
    int arr1[10] = {0};
    printf("%d\n",sizeof(arr1)); //40
    printf("%d\n",sizeof(arr1[0])); //4
    printf("%d\n",sizeof(arr1)/sizeof(arr1[0])); //10 元素个数

    // ~ 按(二进制)位取反 0变1 1变0
    int p = 0;
    // 00000000 00000000 00000000 00000000 --> 11111111 11111111 11111111 11111111
    // 整数在内存中是以补码的形式存储的 (一个整数的二进制表示有三种：原码、反码、补码) 正整数一致
    // 原码：负数的原码是在其对应的正数的原码的基础上，符号位为1，其余位不变
    // 反码：负数的反码是在其对应的正数的反码的基础上，符号位为1，其余位取反
    // 补码：负数的补码是在其对应的正数的补码的基础上，符号位为1，其余位取反，最后+1
    // -1 --> 10000000 00000000 00000000 00000001 --> 11111111 11111111 11111111 11111110 --> 11111111 11111111 11111111 11111111
    
    printf("%d\n",~p); // -1

    // ++ --
    int q = 10;
    int r = ++q;  //先自增，再赋值
    printf("q = %d r = %d\n",q,r); //11 11
    int s = 10;
    int t = s++;  //先赋值，再自增
    printf("s = %d t = %d\n",s,t); //11 10


    // 间接访问操作符 * 取地址 &
    
    // 强制类型转换 (类型)变量
    int u = (int)3.14;
    printf("%d\n",u); 

    // > < >= <= == !=
    // 逻辑操作符 && || 
    int v = 10;
    int w = 20;
    if(v > 10 && w < 20)
    {
        printf("v > 10 && w < 20\n");
    }
    else
    {
        printf("v <= 10 || w >= 20\n");
    }

    // 条件操作符(三目操作符) exp1 ? exp2 : exp3
    // 如果exp1为真，返回exp2，否则返回exp3
    int x = 10;
    int y = 20;
    int max = x > y ? x : y;
    printf("max = %d\n",max);

    // 逗号表达式
    int aa = 10;
    int bb = 20;
    int cc = 30;
    int dd = (aa++,bb++,cc++);
    printf("dd = %d\n",dd); //30 (a++,b++,c++) 从左到右依次执行，最后返回最右边的值

    //下标引用，函数调用，结构成员 . ->
    int arr2[10] = {1,2,3,4,5,6,7,8,9,10};
    printf("%d\n",arr2[0]); // [] 下标引用

    // 调用函数的时候，函数名后边的() 就是函数调用操作符
    printf("hello world");

    return 0;
    

}